intel_SSDPE2KX010T8.log
Intel DC P4510 1TB NVMe PCI-E 3.1 x4 3D TLC 2.5" 15mm 1DWPD
https://www.intel.com/content/www/us/en/products/memory-storage/solid-state-drives/data-center-ssds/d7-series/dc-p4510-series/dc-p4510-1tb-2-5inch-3d2.html

$ udisksctl  status
MODEL                     REVISION  SERIAL               DEVICE
--------------------------------------------------------------------------
INTEL SSDPE2KX010T8                 BTLJ737303RZ1P0FGN   nvme0n1 

$ sudo lshw -C storage
              *-storage                                   
                   description: Non-Volatile memory controller                                     
                   product: Express Flash NVMe P4500/P4600
                   vendor: Intel Corporation                                           
                   physical id: 0       
                   bus info: pci@0000:de:00.0                                         
                   version: 00          
                   width: 64 bits                                                                  
                   clock: 33MHz                        
                   capabilities: storage pm msix pciexpress msi nvm_express bus_master cap_list rom
                   configuration: driver=nvme latency=0
                   resources: irq:144 memory:eeb00000-eeb03fff memory:eeb10000-eeb1ffff


$ time ./run-tests.sh --no-tarball --yes --class randrw --job 4k
Logging to /test/fio/fio-perf-test-1594993572/fio-perf-test-1594993572.log
###########################################################
#
#  Running test='fio-perf-test' job='4k'
#  Results dir: randrw-4k.results
#
###########################################################
4k: (g=0): rw=randrw, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
fio-3.1
Starting 1 process
4k: Laying out IO files (240 files / total 63616MiB)

4k: (groupid=0, jobs=1): err= 0: pid=9552: Fri Jul 17 07:53:32 2020
   read: IOPS=13.7k, BW=53.6MiB/s (56.2MB/s)(15.7GiB/300001msec)
    slat (nsec): min=1618, max=1068.4k, avg=22872.38, stdev=17856.34
    clat (usec): min=54, max=10305, avg=4584.87, stdev=449.88
     lat (usec): min=60, max=10324, avg=4608.32, stdev=451.28
    clat percentiles (usec):
     |  1.00th=[ 3032],  5.00th=[ 4113], 10.00th=[ 4228], 20.00th=[ 4359],
     | 30.00th=[ 4490], 40.00th=[ 4555], 50.00th=[ 4621], 60.00th=[ 4686],
     | 70.00th=[ 4752], 80.00th=[ 4883], 90.00th=[ 5014], 95.00th=[ 5080],
     | 99.00th=[ 5276], 99.50th=[ 5407], 99.90th=[ 5604], 99.95th=[ 5800],
     | 99.99th=[ 6259]
   bw (  KiB/s): min=20400, max=152888, per=100.00%, avg=57241.82, stdev=7469.79, samples=30000
   iops        : min= 5100, max=38222, avg=14311.79, stdev=1867.45, samples=30000
  write: IOPS=13.7k, BW=53.6MiB/s (56.2MB/s)(15.7GiB/300001msec)
    slat (nsec): min=1800, max=1025.2k, avg=34340.39, stdev=22217.81
    clat (usec): min=94, max=10392, avg=4678.38, stdev=317.06
     lat (usec): min=107, max=10423, avg=4713.45, stdev=317.37
    clat percentiles (usec):
     |  1.00th=[ 3949],  5.00th=[ 4228], 10.00th=[ 4293], 20.00th=[ 4424],
     | 30.00th=[ 4555], 40.00th=[ 4621], 50.00th=[ 4686], 60.00th=[ 4752],
     | 70.00th=[ 4817], 80.00th=[ 4948], 90.00th=[ 5080], 95.00th=[ 5145],
     | 99.00th=[ 5407], 99.50th=[ 5473], 99.90th=[ 5669], 99.95th=[ 5735],
     | 99.99th=[ 6128]
   bw (  KiB/s): min=39111, max=148888, per=100.00%, avg=57230.89, stdev=6126.62, samples=30000
   iops        : min= 9777, max=37222, avg=14307.55, stdev=1531.53, samples=30000
  lat (usec)   : 100=0.01%, 250=0.04%, 500=0.06%, 750=0.05%, 1000=0.06%
  lat (msec)   : 2=0.22%, 4=1.43%, 10=98.14%, 20=0.01%
  cpu          : usr=13.69%, sys=55.68%, ctx=6855963, majf=0, minf=1866
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=110.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwt: total=4116125,4114963,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=53.6MiB/s (56.2MB/s), 53.6MiB/s-53.6MiB/s (56.2MB/s-56.2MB/s), io=15.7GiB (16.9GB), run=300001-300001msec
  WRITE: bw=53.6MiB/s (56.2MB/s), 53.6MiB/s-53.6MiB/s (56.2MB/s-56.2MB/s), io=15.7GiB (16.9GB), run=300001-300001msec

Disk stats (read/write):
  nvme0n1: ios=4550872/9854064, merge=0/2877810, ticks=442088/171684, in_queue=344272, util=59.52%

Done.

real	7m20.388s
user	0m58.724s
sys	4m2.378s

$ ./run-tests.sh --no-tarball --yes --class randrw --job 4m
Logging to /test/fio/fio-perf-test-1594994788/fio-perf-test-1594994788.log
###########################################################
#
#  Running test='fio-perf-test' job='4m'
#  Results dir: randrw-4m.results
#
###########################################################
4m: (g=0): rw=randrw, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=32
fio-3.1
Starting 1 process
4m: Laying out IO files (240 files / total 63156MiB)
4m: No I/O performed by libaio, perhaps try --debug=io option for details?

4m: (groupid=0, jobs=1): err= 0: pid=10813: Fri Jul 17 08:08:56 2020
   read: IOPS=190, BW=763MiB/s (800MB/s)(7816MiB/10248msec)
    slat (usec): min=179, max=62445, avg=954.79, stdev=3900.46
    clat (msec): min=3, max=183, avg=43.97, stdev=27.45
     lat (msec): min=3, max=183, avg=44.93, stdev=27.25
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   12], 10.00th=[   14], 20.00th=[   19],
     | 30.00th=[   24], 40.00th=[   32], 50.00th=[   41], 60.00th=[   49],
     | 70.00th=[   56], 80.00th=[   64], 90.00th=[   80], 95.00th=[   97],
     | 99.00th=[  129], 99.50th=[  138], 99.90th=[  174], 99.95th=[  184],
     | 99.99th=[  184]
   bw (  MiB/s): min=  363, max= 6000, per=100.00%, avg=1283.52, stdev=946.25, samples=634
   iops        : min=   90, max= 1500, avg=320.88, stdev=236.39, samples=634
  write: IOPS=190, BW=771MiB/s (809MB/s)(7904MiB/10248msec)
    slat (usec): min=453, max=87558, avg=2162.82, stdev=7110.69
    clat (msec): min=19, max=303, avg=120.13, stdev=44.51
     lat (msec): min=21, max=304, avg=122.29, stdev=44.75
    clat percentiles (msec):
     |  1.00th=[   43],  5.00th=[   60], 10.00th=[   70], 20.00th=[   82],
     | 30.00th=[   92], 40.00th=[  102], 50.00th=[  114], 60.00th=[  126],
     | 70.00th=[  140], 80.00th=[  159], 90.00th=[  184], 95.00th=[  205],
     | 99.00th=[  243], 99.50th=[  249], 99.90th=[  300], 99.95th=[  305],
     | 99.99th=[  305]
   bw (  MiB/s): min=  363, max= 6800, per=100.00%, avg=1731.44, stdev=1468.67, samples=473
   iops        : min=   90, max= 1700, avg=432.66, stdev=367.25, samples=473
  lat (msec)   : 4=0.23%, 10=1.46%, 20=10.16%, 50=20.52%, 100=35.14%
  lat (msec)   : 250=33.09%, 500=0.21%
  cpu          : usr=9.90%, sys=19.79%, ctx=1540, majf=0, minf=32944
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=393.2%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwt: total=1950,1949,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=763MiB/s (800MB/s), 763MiB/s-763MiB/s (800MB/s-800MB/s), io=7816MiB (8196MB), run=10248-10248msec
  WRITE: bw=771MiB/s (809MB/s), 771MiB/s-771MiB/s (809MB/s-809MB/s), io=7904MiB (8288MB), run=10248-10248msec

Disk stats (read/write):
  nvme0n1: ios=244576/248027, merge=0/2077, ticks=6873512/13790912, in_queue=20636956, util=99.56%

Done.